[
  {
    "company": "Grupo Nagal S.A.S",
    "role": "Desarrollador de Software (Frontend & Mobile)",
    "period": "Mayo 2024 – Diciembre 2025",
    "tasks": [
      "Desarrollo de interfaces web con TypeScript y Stencil, creando componentes reutilizables y librerías compartidas.",
      "Diseño e implementación de interfaces responsivas, accesibles y orientadas a la experiencia de usuario.",
      "Desarrollo de aplicaciones móviles con Flutter y Dart desde la concepción hasta la entrega.",
      "Integración y consumo de APIs REST.",
      "Migración y modernización de aplicaciones móviles y web para mejorar mantenibilidad y escalabilidad.",
      "Coordinación técnica y gestión del proyecto móvil (Project Manager).",
      "Implementación de procesos de cargas masivas y sincronización entre plataformas.",
      "Aplicación de buenas prácticas de desarrollo y control de versiones."
    ],
    "website": "https://bosquenagal.com/",
    "instagram": "https://www.instagram.com/bosque_nagal"
  },
  {
    "company": "Fundación FUNIGUALDADH",
    "role": "Desarrollador de Software",
    "period": "Marzo 2024 – Julio 2024",
    "tasks": [
      "Refactorización y mejora de código para optimizar rendimiento y mantenibilidad.",
      "Ajustes y mejoras en Backend para soporte de nuevas funcionalidades.",
      "Diseño y ajustes de Frontend enfocados en UX/UI.",
      "Desarrollo e integración de nuevos módulos funcionales.",
      "Trabajo colaborativo en pruebas, despliegues y soporte técnico."
    ],
    "website": "https://funigualdadh.org/",
    "instagram": "https://www.instagram.com/funigualdadh"
  },
  {
    "company": "Proyecto Instituto Francés",
    "role": "Desarrollador de Software & Gestor de Proyecto",
    "period": "Abril 2025 – Actualidad",
    "tasks": [
      "Desarrollo de plataforma web institucional para oferta de servicios de aprendizaje de idiomas.",
      "Implementación de interfaces modernas y responsivas enfocadas en UX.",
      "Desarrollo con TypeScript, Vite y Node.js.",
      "Despliegue y gestión del dominio en Vercel.",
      "Integración de Supabase para datos, autenticación y servicios Backend.",
      "Coordinación del desarrollo inicial del aplicativo móvil (en construcción).",
      "Gestión del proyecto bajo metodologías ágiles con enfoque en escalabilidad."
    ],
    "website": "https://www.institutofrances.org/",
    "instagram": "https://www.instagram.com/institutofrances"
  }
]
